Revit 2026 API

# ExportLineweightInfo(ExportLineweightInfo) Constructor

---

Constructs a new copy of the input ExportLineweightInfo object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ExportLineweightInfo(
	ExportLineweightInfo other
)
```
```vb
Public Sub New (
	other As ExportLineweightInfo
)
```
```cpp
public:
ExportLineweightInfo(
	ExportLineweightInfo^ other
)
```
```fsharp
new :
        other : ExportLineweightInfo -> ExportLineweightInfo
```

#### Parameters

other ExportLineweightInfo

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExportLineweightInfo Class

ExportLineweightInfo Overload

Autodesk.Revit.DB Namespace